
## Plan Result (stg)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 3 to change, 3 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.sc_team_members_final_read
* Update
  * module.finalsa_storage_account.azurerm_storage_account.storage_account
  * module.ingestsa_storage_account.azurerm_storage_account.storage_account
  * module.vodasa_storage_account.azurerm_storage_account.storage_account
* Delete
  * azurerm_role_assignment.editvm_final_contrib
  * azurerm_role_assignment.sc_team_members_final_contrib
* Replace
  * azurerm_role_assignment.sc_team_members_voda_contrib


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.editvm_final_contrib will be destroyed
  # (because azurerm_role_assignment.editvm_final_contrib is not in configuration)
  - resource "azurerm_role_assignment" "editvm_final_contrib" {
      - id                                     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsastg/providers/Microsoft.Authorization/roleAssignments/9c85c67e-9673-a439-5ee1-194f43e1833c" -> null
      - name                                   = "9c85c67e-9673-a439-5ee1-194f43e1833c" -> null
      - principal_id                           = "f9012fd8-6c95-4c18-a1ba-58d0fb03319c" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/providers/Microsoft.Authorization/roleDefinitions/17d1049b-9a84-46fb-8f53-869881c3d3ab" -> null
      - role_definition_name                   = "Storage Account Contributor" -> null
      - scope                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsastg" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.sc_team_members_final_contrib will be destroyed
  # (because azurerm_role_assignment.sc_team_members_final_contrib is not in configuration)
  - resource "azurerm_role_assignment" "sc_team_members_final_contrib" {
      - id                                     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsastg/providers/Microsoft.Authorization/roleAssignments/061126ef-9e00-6f2e-c97d-e2a698291cba" -> null
      - name                                   = "061126ef-9e00-6f2e-c97d-e2a698291cba" -> null
      - principal_id                           = "ad922d96-041a-4fd0-ac58-9205d3e5b33d" -> null
      - principal_type                         = "Group" -> null
      - role_definition_id                     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/providers/Microsoft.Authorization/roleDefinitions/17d1049b-9a84-46fb-8f53-869881c3d3ab" -> null
      - role_definition_name                   = "Storage Account Contributor" -> null
      - scope                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsastg" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.sc_team_members_final_read will be created
  + resource "azurerm_role_assignment" "sc_team_members_final_read" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ad922d96-041a-4fd0-ac58-9205d3e5b33d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Reader"
      + scope                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsastg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.sc_team_members_voda_contrib must be replaced
-/+ resource "azurerm_role_assignment" "sc_team_members_voda_contrib" {
      ~ id                                     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prevodasastg/providers/Microsoft.Authorization/roleAssignments/6a89e4f6-d0bb-1c70-d195-a996baefbcc6" -> (known after apply)
      ~ name                                   = "6a89e4f6-d0bb-1c70-d195-a996baefbcc6" -> (known after apply)
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/providers/Microsoft.Authorization/roleDefinitions/17d1049b-9a84-46fb-8f53-869881c3d3ab" -> (known after apply)
      ~ role_definition_name                   = "Storage Account Contributor" -> "Storage Blob Data Reader" # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.finalsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsastg"
        name                               = "prefinalsastg"
        tags                               = {
            "application"         = "pre-recorded-evidence"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

  # module.ingestsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/preingestsastg"
        name                               = "preingestsastg"
        tags                               = {
            "application"         = "pre-recorded-evidence"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

  # module.vodasa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prevodasastg"
        name                               = "prevodasastg"
        tags                               = {
            "application"         = "pre-recorded-evidence"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

Plan: 2 to add, 3 to change, 3 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":964,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->